In [1]:
#1.How do we interchange the values of two lists?

In [2]:
a = [1, 2, 3, 6, 9]
b = [3, 2, 1, 7, 4]
b,a = a,b
print(a,b)

[3, 2, 1, 7, 4] [1, 2, 3, 6, 9]

In [3]:
#2.How do we extract values from list?

In [4]:
r = ['Padayappa','Annamalai','Chandramukhi','Badshah','Sivaji']
print(r[0])
print(r[3])

Padayappa
Badshah

In [5]:
#3.How we create loops in python using list?

In [6]:
a=[]
for i in range(10):
    a.append(i)
print(a)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [7]:
#4.How you can convert a number to a string?

In [8]:
a=10
print(type(a))
converted_num = str(a)
print(type(converted_num))

<class 'int'>
<class 'str'>

In [9]:
#5.How do you generate random numbers in Python?

In [10]:
import random
print(random.random())

0.3453743484297548

In [11]:
#6.How would you convert a list to an array?

In [12]:
import numpy as np
a = [1, 7, 0, 6, 2, 5, 6]
b = np.array(a)
print ("List: ", a)
print ("Array: ", b)

List:  [1, 7, 0, 6, 2, 5, 6]
Array:  [1 7 0 6 2 5 6]

In [13]:
#7.How to create dataframe from list?

In [14]:
import pandas as pd
list = [['Everyone','West'],['is','or'],['invited','East'],['or','Powerstar'],['its','is'],['hard','the'],['imagining','Beast']]
df = pd.DataFrame(list, columns =['Dialogue 1', 'Dialogue 2'])
df

  Dialogue 1 Dialogue 2
0   Everyone       West
1         is         or
2    invited       East
3         or  Powerstar
4        its         is
5       hard        the
6  imagining      Beast

In [15]:
#8.How to create dataframe from dictionary?

In [16]:
dict={
    'Name' : ['Dhoni', 'Sachin', 'Kohli', 'Rooney','Ronaldo'],
    'Age' : [40, 48, 32, 35, 36],
    'Team' : ['CSK', 'MI', 'RCB', 'MAN U', 'RM'],
}
df = pd.DataFrame(dict, index = ['a', 'b', 'c', 'd', 'e'])
df

      Name  Age   Team
a    Dhoni   40    CSK
b   Sachin   48     MI
c    Kohli   32    RCB
d   Rooney   35  MAN U
e  Ronaldo   36     RM

In [17]:
#9.How to import csv?

In [18]:
imp=pd.read_csv(r'C:\Users\User\Documents\ML Workshop\Wholesale customers data.csv')
imp

,Channel,Region,Fresh,Milk,Grocery,Frozen,Detergents_Paper,Delicassen
0,2,3,12669,9656,7561,214,2674,1338
1,2,3,7057,9810,9568,1762,3293,1776
2,2,3,6353,8808,7684,2405,3516,7844
3,1,3,13265,1196,4221,6404,507,1788
4,2,3,22615,5410,7198,3915,1777,5185
...,...,...,...,...,...,...,...,...
435,1,3,29703,12051,16027,13135,182,2204
436,1,3,39228,1431,764,4510,93,2346
437,2,3,14531,15488,30243,437,14841,1867
438,1,3,10290,1981,2232,1038,168,2125
439,1,3,2787,1698,2510,65,477,52

In [19]:
#10.How do you select columns from dataframe?

In [20]:
imp['Channel']

0      2
1      2
2      2
3      1
4      2
      ..
435    1
436    1
437    2
438    1
439    1
Name: Channel, Length: 440, dtype: int64

In [21]:
#11.How do you select rows from dataframe?

In [22]:
imp.iloc[12]

Channel                 2
Region                  3
Fresh               31714
Milk                12319
Grocery             11757
Frozen                287
Detergents_Paper     3881
Delicassen           2931
Name: 12, dtype: int64

In [23]:
#12.How do you select both rows and columns from dataframe?

In [24]:
imp['Region'].iloc[18]

3

In [25]:
#13.How do you select rows based on indices?

In [26]:
a = [8, 25, 49, 125, 202, 300]
rows = imp.loc[a]
rows

,Channel,Region,Fresh,Milk,Grocery,Frozen,Detergents_Paper,Delicassen
8,1,3,5963,3648,6192,425,1716,750
25,2,3,16165,4230,7595,201,4003,57
49,2,3,4967,21412,28921,1798,13583,1163
125,1,3,76237,3473,7102,16538,778,918
202,1,1,25203,11487,9490,5065,284,6854
300,2,2,16448,6243,6360,824,2662,2005

In [27]:
#14.How do you find the median value?

In [28]:
imp['Fresh'].median()

8504.0

In [29]:
#15.How do you find the unique values?

In [30]:
imp['Frozen'].unique()

array([  214,  1762,  2405,  6404,  3915,   666,   480,  1669,   425,
        1159,  4400,  1420,   287,  3095,   294,   397,   134,   839,
        2205,   669,  1066,  3383,  9408,  5154,  2915,   201,  3151,
         485,  1158,  1200,  1148,  2088,   266,  6130,   833,  1729,
        1920,    33, 10002,  9510,  2033,   188,   787,   541,  1740,
        1668,  7782,   584,  1798,  3860,   239,   532,   744,  2436,
        1057,  2616,    38,   596,   129,    96,  3254,  4154,  2896,
        3724,    36,   175,  1256,  5870,   779, 10643,  5373,  8872,
        8132,  1285,  4407,  7530,   869,  2096,   868,   430,   283,
         737,  2320,  1178,  1026,   987,  6312,  9735,  3443,  3347,
        8693,  3232, 35009,   206,   440,   145,   774,   895,  5639,
        3252,  1593,  2561, 18028,  1336,   910,   133,  2471,   247,
         673,  2276,   805,  8853,  3220,  2555,  2715,  1517,  1647,
        5343,  3896,  2417,  2395,  1991,  2194,  4787, 16538,  8195,
         880,   142,  1718,  6316,   346,   576,   436,   720,  1170,
        4575,   661,   155,   825,  2279,   321,  2995,  8425,   118,
          42,   926,  1286,  4052,   800,   853,   531,  3001,    75,
         233,   317,  3378,   930,   398,   824,  1092,  2665,  2367,
        2540,  4425,   993,   405,  1393,  2399,  1116,   651,   333,
         937,  2515,    52,  7368,  1752,  1152,  4477,   402, 16745,
         443, 36534,    74,  2181,  3470,  6269,  2758,   275,  7332,
         890,   547,   959,   806,  7888, 18711,  1127,  3527,   520,
        3941,  3549,  5065,   469,  1383,   955,   878,  2946,  1859,
         864,  1801,  4736,  1291,  1329,   913,  1374,   179,  2532,
        2306,  1765,    91,  7496,  5612,   784,   660,  1759,  2286,
         950,  6845,  8321,  1439,   638,  4260,  1218,  2312,  4634,
        1112,  5243, 11422,  2216,  3752,   561,  1183,   230,  1777,
        2077,   559,  6340,  1730,  6746,  7683,   432,  4686,  3242,
         453,  5004,  6422,  3012,   327,  6818,   982,  4324,    61,
       10155,  2221,  3975,  1069,  2516,  5500,  1120,   529,  4802,
         862,  4479, 16919,  5845,  1293,   977,  1093,  5970, 10303,
        8692,  1042,  1619,  8366,   848,  1388,   502,  2507,  3838,
         902,   909,   417,  3045,  1455,   934,   264,  1809,   364,
         492,   617,   799,  1840,  1149,   416,  1465, 12569,  3046,
        1274,  4447,  1483,   662,  2679,   978,  2121,  1128,   514,
        2714,  3703,   915,  2369, 60869,  3498,   414,  7849,  5127,
        3570,  1234,  2208,   131, 11559,  1365,   650,  8170, 15601,
        9584,   388,   767,   349,  1456,  2234,  2693,  2809,  1341,
        2005,  1796,  1741,   830,   228,  6386,   245,  3157,   137,
        6114,   340,  2601,  1206,   560,   191,  1103,  1173,  1457,
        2046,  1089,  1364,  8164,   876,  1504,  1492,   597,  5641,
        1034,   282,   130,  3881,  9927,  4006,  3635,  2583,  1945,
        1960,  1677,  3019,  5502,   907,   659,  8620,  1398,  2921,
        2644,  6838,  5390,  1601,  3576, 13223,   220,   127,  2069,
        9806,  2854,  1646,  2349,  1389,  1535,    98, 17866,  5679,
        1691,   633,    25,  1031,  1059,   874, 15348,  3141, 15082,
        2198,    47,   575, 13486,   269,  1541,   688, 13135,  4510,
         437,  1038,    65], dtype=int64)

In [31]:
#16.How do you find count of unique values?

In [32]:
imp['Grocery'].value_counts()

683      2
1493     2
3600     2
2406     2
10391    2
        ..
223      1
11593    1
314      1
16709    1
5119     1
Name: Grocery, Length: 430, dtype: int64